'''
Дано натуральное число. Напишите функцию возвращающую число десятков в его десятичной записи.
'''

def first_task(x: int) -> int:
    print(x // 10)